package task;

public class task {
    public static void main(String[] args) {
        //Сложение целых чисел: Объявите две целочисленные переменные и присвойте им значения. Выведите их сумму в консоль.
        int num1 = 10;
        int num2 = 11;

        System.out.println("Результат: " + (num1 + num2));

        //Вычитание целых чисел: Объявите две целочисленные переменные и присвойте им значения. Выведите их разность в консоль.
        byte num3 = 56;
        byte num4 = 35;

        System.out.println("Результат: " + (num3 - num4));

        //Умножение целых чисел: Объявите две целочисленные переменные и присвойте им значения. Выведите их произведение в консоль.
        byte num5 = 7;
        byte num6 = 3;

        System.out.println("Результат: " + (num5 * num6));

        //Деление целых чисел: Объявите две целочисленные переменные и присвойте им значения. Выведите результат деления первого числа на второе в консоль.
        int num7 = 315;
        int num8 = 15;

        System.out.println("Результат: " + (num7 / num8));

        //Деление по модулю: Объявите две целочисленные переменные и присвойте им значения. Выведите остаток от деления первого числа на второе в консоль.
        byte num9 = 11;
        byte num10 = 3;

        System.out.println("Результат: " + (num9 % num10));

        //инкремент: Объявите целочисленную переменную и присвойте ей значение. Увеличьте значение переменной на 1 и выведите результат в консоль.
        int numberOne = 20;
        numberOne++;

        System.out.println("Результат: " + numberOne);

        //Декремент: Объявите целочисленную переменную и присвойте ей значение. Уменьшите значение переменной на 1 и выведите результат в консоль.
        byte numberTwo = 10;
        numberTwo--;

        System.out.println("Результат: " + numberTwo);

        //Сложение чисел с плавающей запятой: Объявите две переменные с плавающей точкой и присвойте им значения. Выведите их сумму в консоль.
        double numberThree = 3.14;
        double numberFour = 2.715;

        System.out.println("Результат: " + (numberThree + numberFour));

        //Вычитание чисел с плавающей запятой: Объявите две переменные с плавающей точкой и присвойте им значения. Выведите их разность в консоль.
        double numberFive = 14.1;
        double numberSix = 7.32;

        System.out.println("Ответ: " + (numberFive - numberSix));

        //Умножение чисел с плавающей запятой: Объявите две переменные с плавающей точкой и присвойте им значения. Выведите их произведение в консоль.
        double numberSeven = 2.89;
        double numberEight = 5.5;

        System.out.println("Умножили: " + (numberSeven * numberEight));

        //Деление чисел с плавающей запятой: Объявите две переменные с плавающей точкой и присвойте им значения. Выведите результат деления первого числа на второе в консоль.
        double numberNine = 27.89;
        double numberTen = 9.43;

        System.out.println("Поделили: " + (numberNine / numberTen));

        //Инкремент для числа с плавающей запятой: Объявите переменную с плавающей точкой и присвойте ей значение. Увеличьте значение переменной на 1 и выведите результат в консоль.
        double numberAgain = 7.89;
        ++numberAgain;

        System.out.println("Результат: " + numberAgain);

        //Декремент для числа с плавающей запятой: Объявите переменную с плавающей точкой и присвойте ей значение. Уменьшите значение переменной на 1 и выведите результат в консоль.
        double noNumber = 9.99;
        --noNumber;

        System.out.println("Result: " + noNumber);

        //Логическое И: Объявите две логические переменные и присвойте им значения. Выведите результат логического И в консоль.
        boolean alpha = true;
        boolean beta = false;

        System.out.println("result: " + (alpha && beta));

        //Логическое ИЛИ: Объявите две логические переменные и присвойте им значения. Выведите результат логического ИЛИ в консоль.
        boolean charly = false;
        boolean gamma = true;

        System.out.println("Result: " + (charly || gamma));

        //Логическое отрицание: Объявите логическую переменную и присвойте ей значение. Выведите результат логического отрицания в консоль.
        boolean odin = true;

        System.out.println("Resultat: " + !odin);

        //Сложение символов: Объявите две переменные типа char и присвойте им значения символов. Выведите результат их сложения в консоль.
        char pershi = 56;
        char druhi = 77;
        //?????????????????????????????????????????????????????????????????????????
        System.out.println("Result: " + (pershi + druhi));

        //Сложение двух строк: Объявите две строки и присвойте им значения. Выведите результат их конкатенации в консоль.

        //Деление с плавающей запятой и приведение к целому типу: Объявите две переменные с плавающей запятой и присвойте им значения. Выполните деление одной переменной на другую и приведите результат к целочисленному типу. Выведите результат в консоль.
        double doubleOne = 88.9;
        double doubleTwo = 2.7;
        int result = (int) (doubleOne / doubleTwo);

        System.out.println("Result: " + result);

        //Проверка на четность целого числа: Объявите целочисленную переменную и присвойте ей значение. Проверьте, является ли число четным, и выведите соответствующее сообщение в консоль.

        //Приведение типов: Объявите переменную типа double и присвойте ей значение. Приведите это значение к целочисленному типу и выведите результат в консоль.

        //Проверка на равенство двух чисел: Объявите две переменные и присвойте им значения. Проверьте, равны ли они между собой, и выведите соответствующее сообщение в консоль.

        //Проверка на неравенство двух чисел: Объявите две переменные и присвойте им значения. Проверьте, не равны ли они между собой, и выведите соответствующее сообщение в консоль.

        //Проверка на положительное число: Объявите переменную и присвойте ей значение. Проверьте, является ли число положительным, и выведите соответствующее сообщение в консоль.

        //Проверка на отрицательное число: Объявите переменную и присвойте ей значение. Проверьте, является ли число отрицательным, и выведите соответствующее сообщение в консоль.

        //Проверка на нулевое значение: Объявите переменную и присвойте ей значение. Проверьте, является ли число нулем, и выведите соответствующее сообщение в консоль.

        //Проверка на четность числа без использования остатка от деления: Объявите переменную и присвойте ей значение. Проверьте, является ли число четным без использования оператора остатка от деления и выведите соответствующее сообщение в консоль.

        //Проверка на нечетность числа без использования остатка от деления: Объявите переменную и присвойте ей значение. Проверьте, является ли число нечетным без использования оператора остатка от деления и выведите соответствующее сообщение в консоль.

        //Проверка числа на простоту: Объявите переменную и присвойте ей значение. Проверьте, является ли число простым, и выведите соответствующее сообщение в консоль.

        //Сравнение целых чисел: Объявите две целочисленные переменные и сравните их между собой. Выведите результат сравнения в консоль.

        //Сравнение чисел с плавающей запятой: Объявите две переменные с плавающей точкой и сравните их между собой. Выведите результат сравнения в консоль.

        //Сравнение строк: Объявите две строки и сравните их. Выведите результат сравнения в консоль.

        //Сравнение символов: Объявите две переменные типа char и сравните их между собой. Выведите результат сравнения в консоль.

        //Сравнение целого числа и числа с плавающей запятой: Объявите целочисленную переменную и переменную с плавающей запятой. Сравните их между собой и выведите результат в консоль.

        //Сравнение целого числа с нулем: Объявите целочисленную переменную и сравните ее с нулем. Выведите результат в консоль.

        //Сравнение числа с плавающей запятой с нулем: Объявите переменную с плавающей запятой и сравните ее с нулем. Выведите результат в консоль.

        //Сравнение двух логических значений: Объявите две логические переменные и сравните их между собой. Выведите результат в консоль.

        //Сравнение числа с нулем с помощью оператора "меньше": Объявите переменную и сравните ее с нулем с помощью оператора "<". Выведите результат в консоль.

        //Сравнение числа с нулем с помощью оператора "больше": Объявите переменную и сравните ее с нулем с помощью оператора ">". Выведите результат в консоль.

        //Сравнение числа с плавающей запятой на равенство с другим числом: Объявите переменную с плавающей запятой и сравните ее с другим числом на равенство. Выведите результат в консоль.

    }
}
