package hardtask;

public class HardOne {
    public static void main(String[] args) {
        //Проверка на четность и деление на 5: Напишите программу, которая проверяет, является ли целое число четным или делится ли оно на 5.
        //Если число четное или делится на 5, выведите сообщение об этом.
        int number = 115;
        if (number % 2 == 0 || number % 5 == 0) {
            System.out.println("Успех"); // не миксуй языки
        } else
            System.out.println("eror"); // не миксуй языки
    }
}
